In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame(
    {
        "Name" : [ "Abby", "Bob", "Chris", "Dave", "Ellen", "Fran", "Greg", "Helen", "Iris", "Jim"],
        "Grade": [ 7.0, 9.0, 10.0, 8.0, 7.0, 10.0, 8.0, np.nan, 10.0, 8.0],
        "Year" : ["Freshman", "Sophomore", "Senior", "Freshman", "Sophomore", "Senior", "Freshman", "Sophomore", "Senior", "Freshman"]
    }
)

In [3]:
df.head()

    Name  Grade       Year
0   Abby    7.0   Freshman
1    Bob    9.0  Sophomore
2  Chris   10.0     Senior
3   Dave    8.0   Freshman
4  Ellen    7.0  Sophomore

In [4]:
df.tail()

    Name  Grade       Year
5   Fran   10.0     Senior
6   Greg    8.0   Freshman
7  Helen    NaN  Sophomore
8   Iris   10.0     Senior
9    Jim    8.0   Freshman

In [18]:
df.sample(5)

    Name  Grade       Year
5   Fran   10.0     Senior
0   Abby    7.0   Freshman
3   Dave    8.0   Freshman
2  Chris   10.0     Senior
1    Bob    9.0  Sophomore

In [5]:
list(df.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [20]:
df.loc[:,"Grade"]

0     7.0
1     9.0
2    10.0
3     8.0
4     7.0
5    10.0
6     8.0
7     NaN
8    10.0
9     8.0
Name: Grade, dtype: float64

In [33]:
df['Grade'].sum()

77.0

In [36]:
pd.nan

AttributeError: module 'pandas' has no attribute 'nan'

In [21]:
df.loc[0:4, "Grade"]

0     7.0
1     9.0
2    10.0
3     8.0
4     7.0
Name: Grade, dtype: float64

In [23]:
df.loc[5:,"Name"]

5     Fran
6     Greg
7    Helen
8     Iris
9      Jim
Name: Name, dtype: object

In [ ]:
df.iloc[0,0]

In [24]:
df.loc[4,"Name"]

'Ellen'

In [26]:
df.loc[9,"Name"] = "Jimmy"

In [45]:
df = pd.concat([ df, pd.DataFrame({ "Name": ["Karen", "Lynne", "Mike", "Nico", "Pete"], "Grade": [7.5, 10, 10, np.nan, 8.0], "Year": ["Freshman", "Sophomore", "Sophomore", "Junior", "Freshman" ] }) ],ignore_index=True)

In [46]:
df.to_csv("students-no-header.csv", header=False, index=False, sep=",")

In [49]:
df.to_csv("students-header.psv", header=True, index=False, sep="|")

In [28]:
# Reading in a real file
df = pd.read_csv("https://raw.githubusercontent.com/mafudge/datasets/master/exam-scores/exam-scores.csv")

In [29]:
df

,Class_Section,Exam_Version,Completion_Time,Made_Own_Study_Guide,Did_Exam_Prep Assignment,Studied_In_Groups,Student_Score,Percentage,Letter_Grade
0,M01,A,20,N,N,Y,24,80.00%,B
1,M01,A,20,?,?,?,27,90.00%,A-
2,M01,A,30,Y,Y,Y,30,100.00%,A
3,M01,A,50,N,Y,Y,18,60.00%,C-
4,M01,A,55,Y,Y,N,24,80.00%,B
...,...,...,...,...,...,...,...,...,...
60,M02,D,40,?,?,?,23,76.70%,B-
61,M02,D,45,Y,Y,N,22,73.30%,C+
62,M02,D,45,?,?,?,24,80.00%,B
63,M02,D,55,Y,Y,N,24,80.00%,B
64,M02,D,60,N,N,Y,24,80.00%,B

In [30]:
df.describe()

       Completion_Time  Student_Score
count        65.000000      65.000000
mean         40.615385      22.738462
std          14.348010       3.890200
min          15.000000      13.000000
25%          25.000000      21.000000
50%          40.000000      23.000000
75%          55.000000      25.000000
max          60.000000      30.000000

In [32]:
sg = df[df.Made_Own_Study_Guide =="Y"]

In [33]:
sg.describe()

       Completion_Time  Student_Score
count        26.000000      26.000000
mean         44.423077      24.269231
std          14.582656       3.779499
min          15.000000      16.000000
25%          36.250000      22.000000
50%          47.500000      24.500000
75%          55.000000      27.000000
max          60.000000      30.000000

In [35]:
ep = df[ df['Did_Exam_Prep Assignment']=="Y"]

In [36]:
ep.describe()

       Completion_Time  Student_Score
count        28.000000      28.000000
mean         40.892857      24.214286
std          13.197473       3.370429
min          15.000000      16.000000
25%          30.000000      23.000000
50%          45.000000      24.000000
75%          50.000000      26.250000
max          60.000000      30.000000

In [37]:
sg_and_ep = df[ (df['Did_Exam_Prep Assignment']=="Y") & (df.Made_Own_Study_Guide=="Y")]

In [38]:
sg_and_ep.describe()

       Completion_Time  Student_Score
count        18.000000      18.000000
mean         40.555556      25.000000
std          15.135553       3.694193
min          15.000000      16.000000
25%          26.250000      24.000000
50%          45.000000      25.500000
75%          53.750000      27.750000
max          60.000000      30.000000

In [39]:
grp = df[ df['Studied_In_Groups']=='Y']

In [40]:
grp.describe()

       Completion_Time  Student_Score
count        27.000000      27.000000
mean         38.518519      23.444444
std          15.368225       4.353013
min          15.000000      13.000000
25%          25.000000      21.500000
50%          35.000000      24.000000
75%          50.000000      26.000000
max          60.000000      30.000000

In [41]:
sall = df[ (df['Did_Exam_Prep Assignment']=="Y") & (df.Made_Own_Study_Guide=="Y") & (df.Studied_In_Groups=="Y")]

In [42]:
sall.describe()

       Completion_Time  Student_Score
count         8.000000        8.00000
mean         35.625000       27.50000
std          15.683818        1.85164
min          15.000000       25.00000
25%          23.750000       26.00000
50%          35.000000       27.50000
75%          46.250000       28.50000
max          60.000000       30.00000

In [1]:
!curl https://raw.githubusercontent.com/mafudge/PandasYouTubeSeries/main/json_sample.json -o json_sample.json

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100  7080  100  7080    0     0  37453      0 --:--:-- --:--:-- --:--:-- 37659

In [56]:
pd.read_csv("students-header-blanks.csv", skiprows=5).head(5)

    Name  Grade       Year
0   Abby    7.0   Freshman
1    Bob    9.0  Sophomore
2  Chris   10.0     Senior
3   Dave    8.0   Freshman
4  Ellen    7.0  Sophomore

In [54]:
df2

     Name  Grade       Year
0    Abby    7.0   Freshman
1     Bob    9.0  Sophomore
2   Chris   10.0     Senior
3    Dave    8.0   Freshman
4   Ellen    7.0  Sophomore
5    Fran   10.0     Senior
6    Greg    8.0   Freshman
7   Helen    NaN  Sophomore
8    Iris   10.0     Senior
9   Jimmy    8.0   Freshman
10  Karen    7.5   Freshman
11  Lynne   10.0  Sophomore
12   Mike   10.0  Sophomore
13   Nico    NaN     Junior
14   Pete    8.0   Freshman